const List<Map<String, dynamic>> actualities = [
{
"title": "من أسباب السعادة",
"description": '''فِي أُمُورِ الدُّنْيَا أُنْظُرْ إِلَى مَنْ هُوَ أَقَلُّ مِنْكَ مَالاً وَأَضْعَفُ مِنْكَ جِسْماً وَأَقَلُّ أَوْ لاَ ذُرِّيَةَ لَهُ وَأَكْثَرُ بَلاَءً وَأَشَدُّ أَمْرَاضاً لِتَنْظُرَ فِي نَفْسِكَ فَتَقُولَ الحَمْدُ للهِ عَلَى كُلِّ حَالٍ.
وأما في أمور الدين فانظر إلى من هو أكثر منك علما وأحسن منك حالا لتزداد رغبتك في طاعة الله تعالى.
'''
,"targetTaps" : 1 ,
},
{
    "title": "حديث شريف",
    "description": '''
    🌟🌷🌟🌷🌟🌷🌟🌷
قال رسول الله ﷺ أتاني جبريل ، فقال :
"يا محمد عش ماشئت فإنك ميت، وأحبِب من شئت فإنك مفارقه، واعمل ما شئت فإنك مَجْزِيٌّ به، واعلم أن شرف المؤمن قيامه بالليل، وعِزُّه استغناؤه عن الناس"
🌟🌷🌟🌷🌟🌷🌟
'''
    ,"targetTaps" : 1 ,
},
{
    "title": "حديث عن فضل الوضوء",
    "description": '''
💞✨💞✨💞✨💞✨
وكما همُ المسلمونَ في كلِ زمانٍ ومکانٍ مشتاقون إليه صلى الله عليه وسلّم كذلك هو مشتاقٌ إليهم، فقد قال صلى الله عليه وسلّم: وَدِدْتُ أَنَّا قَدْ رَأَيْنَا إِخْوانَنَا، قالوا: أولسنا إخوانَك يا رسول الله؟ قال: أنْتُم أصحابِي، وإخوَانُنَا الّذينَ لَمْ يَأْتُوا بَعْدُ، فقالوا: كيفَ تعرفُ مَنْ لَم يَأْتِ بَعْدُ مِن أمتك يا رسول الله؟ فقال: أَرَأَيْتَ لَوْ أنَّ رَجُلًا لَهُ خَيْلٌ غُرٌّ مُحَجَّلَةٌ بَيْنَ ظَهْرَيْ خَيْلٍ دُهْمٍ بُهْمٍ أَلَا يَعْرِفُ خَيْلَهُ؟، قالوا: بلی یا رسول الله، قال: فإنَّهُمْ يَأْتُونَ غُرًّا مُحَجَّلِين مِنَ الوُضُوءِ وَأَنَا فَرَطُهُمْ عَلَى الحَوْضِ أي وأنا من سأتقدّمُهم على الحوض.
🌷🌟🌷🌟🌷🌟🌷🌟
'''
    ,"targetTaps" : 1 ,
},
{
    "title": "من أسباب النصر",
    "description": '''
🔴 مهمَا حاولَ أعداءُ هذَا الدينِ إذلالَهُ وإنهاءَهُ فإنَّ اللهَ حافظٌ لهُ ومؤيد أهلَهُ إذَا كانوا صادقينَ مخلصِيْنَ، بالنصرِ والعزةِ والتمكينِ فِي الأرضِ والثباتِ فِي وجهِ أعداءِ الحقِّ مهمَا كَثُرُوا، فَهُمْ يَنظرُونَ إلَى الأسبابِ الماديةِ، والمتوكلُ علَى اللهِ لَا يلتفتُ إلَى عددٍ ولَا عتادٍ بلْ الذي يملَأُ قلبَهُ هوَ التوكلُ علَى اللهِ عزَّ وجلَّ ، فمن كان على هذا الحال فسيَنْصُرهُ اللهُ علَى أعدائِهِ وسَيُمَكِّنُ لهُ فِي الأرضِ مهمَا كَثُرَ المحاربونَ لهُ.

🔴 قال تعالى: ﴿يَا أَيُّهَا الَّذِينَ ءامَنُوا إِن تَنصُرُوا اللَّهَ يَنصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ﴾.

🔴 وقال سبحانه : ﴿وَلِلَّهِ الْعِزَّةُ وَلِرَسُولِهِ وَلِلْمُؤْمِنِينَ وَلَٰكِنَّ الْمُنَافِقِينَ لَا يَعْلَمُونَ ﴾.

🔴 وقال عز وجل :  ﴿أَلَا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ﴾.
'''
    ,"targetTaps" : 1 ,
}
];