const List<Map<String, dynamic>> bahr = [
  {
    "title": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم",
    "description": '''يَا اللَّهُ يَا عَلِيُّ يَا عَظِيمُ يَا حَلِيمُ يَا عَلِيمُ، أَنتَ رَبِّي وَعِلْمُكَ حَسْبِي فَنِعْمَ الرَّبُّ رَبِّي وَنِعْمَ الْحَسْبُ حَسْبِي، تَنْصُرُ مَنْ تَشَاءُ وَأَنتَ الْعَزِيزُ الْرَّحِيمُ.''',
    "targetTaps": 1,
  },
  {
    "title": "",
    "description": '''ِ
نَسْأَلُكَ العِصمَةَ في الْحَرَكَاتِ وَالسَّكَنَاتِ وَالكَلِمَاتِ وَالإِرَادَات وَالْخَطَرَات مِنَ الشُّكُوكِ وَالظُّنُونِ وَالأَوْهَامِ السَّاتِرَةِ لِلْقُلُوبِ عَنْ مُطَالَعَةِ الغُيُوب، ''',
    "targetTaps": 1,
  },
  {
    "title": "",
    "description": '''هُنَالِكَ ابْتُلِيَ الْمُؤْمِنُونَ وَزُلْزِلُوا زِلْزَالاً شَدِيدَاً وَإِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ مَا وَعَدَنَا اللَّهُ وَرَسُولُهُ إِلَّا غُرُوراً،
    ''',
    "targetTaps": 1,
  },
  {
    "title": "",
    "description": '''
فَثَبِّتْنا وَانْصُرْنَا وَسَخِّرْ لَنَا هَذَا البَحْرَ كَمَا سَخَّرتَ البَّحرَ لِموسى، وسَخَّرتَ النَّارَ لإبراهيم، وسَخَّرتَ الجِبالَ وَالْحَديدَ لدِاود، وَسَخَّرتَ الرِّيْحَ وَالجِنَّ وَالشَّياطِينَ لِسُلَيْمَانَ''',
    "targetTaps": 1,
  },
    {
        "title": "",
        "description": '''وَسَخِّر لَنا كُلَّ بَحرٍ هُوَ لَكَ في الأَرْضِ وَالسَّماءِ وَالْمُلْكِ وَالْمَلَكُوتِ وَبَحْرَ الدُّنيَا وبَحْرَ الآخِرة، وَسَخِّر لَنا كُلّ شَيْءٍ يَا مَنْ بِيَدِهِ مَلَكُوتُ كُلّ شَيْءٍ
        ''',
        "targetTaps": 1,
    },
    {
        "title": "3 مرات",
        "description": '''
{كَهَيعص}        ''',
        "targetTaps": 3,
    },
    {
        "title": "",
        "description": '''
أُنْصُرْنا فَإِنَّكَ خَيْرُ النّاصِرين، وَافْتَحْ لَنا فَإِنَّكَ خَيْرُ الفَاتِحين، وَاغْفِرْ لَنا فَإِنَّكَ خَيْرُ الغَافِرين، وَارْحَمْنا فَإِنَّكَ خَيْرُ الرَّاحِمِين، وَارْزُقْنا فَإِنَّكَ خَيْرُ الرَّازِقِين، وَاهْدِنا وَنَجِّنا مِنَ القَومِ الظَّالِمِين،        ''',
        "targetTaps": 1,
    },
{
"title": "",
"description": '''
وَهَبْ لَنا رِيحَاً طَيِّبَةً كمَا هِيَ في عِلْمِكَ، وَانْشُرْها عَلَيْنا مِنْ خَزائِنِ رَحْمَتِك، وَاحْمِلْنَا بِها حَمْلَ الكَرامَةِ مَعَ السَّلامةِ وَالعافِيَةِ في الدِّيْن وَالدُّنيَا وَالآخِرَة، إنَّكَ على كُلّ شَيْءٍ قَدِيرٌ،
''',
"targetTaps": 1,
},
{
"title": "",
"description": '''
 اللَّهُمَّ يَسِّر لَنَا أُمُورَنا مَعَ الرَّاحَةِ لقُلُوبِنا وَأَبْدانِنا، وَالسَّلامةِ وَالعافِيَةِ في دينِنا ودُنيانا، وكُن لَنا صاحِباً في سَفَرِنا وخَليفةً في أهلِنا، ''',
"targetTaps": 1,
},
    {
        "title": "",
        "description": '''وَاطمِسْ على وُجوهِ أعدائِنا وَامْسَخْهُمْ على مكانَتِهِم فَلا يَستَطِيعُونَ الْمُضِيَّ وَلاَ الْمَجِيءَ إلَيْنا،''',
        "targetTaps": 1,
    },
    {
        "title": "",
        "description": '''
وَلَوْ نَشَاءُ لَطَمَسْنَا على أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّى يُبْصِرُونَ، وَلَوْ نَشَاءُ لَمَسَخْنَاهُمْ على مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيَّاً وَلَا يَرْجِعُونَ،
        ''',
        "targetTaps": 1,
    },
    {
        "title": "",
        "description": '''
 يس وَالْقُرْآَنِ الْحَكِيمِ، إِنَّكَ لَمِنَ الْمُرْسَلِينَ، على صِرَاطٍ مُسْتَقِيمٍ، تَنْزِيلَ الْعَزِيزِ الرَّحِيمِ، لِتُنْذِرَ قَوْمَاً مَا أُنْذِرَ آَبَاؤُهُمْ فَهُمْ غَافِلُونَ، لَقَدْ حَقَّ الْقَوْلُ على أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ، إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالاً فَهِيَ إِلَى الْأَذْقَانِ فَهُمْ مُقْمَحُونَ، وَجَعَلْنَا من بَيْنِ أَيْدِيهِمْ سَدَّاً وَمِنْ خَلْفِهِمْ سَدَّاً فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ،
        ''',
        "targetTaps": 1,
    },
    {
        "title": "3 مرات",
        "description": '''
شاهَتِ الوُجُوهُ         ''',
        "targetTaps": 3,
    },
    {
        "title": "",
        "description": '''
وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْماً، طس، حم عسق، مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ، بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ،ُ         ''',
        "targetTaps": 1,
    },
    {
        "title": "7 مرات",
        "description": '''
حم ُ         ''',
        "targetTaps": 7,
    },
    {
        "title": "",
        "description": '''حُمَّ الأَمرُ وجاءَ النَّصرُ فَعَلَيْنا لا يُنصَرون، حم، تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْعَلِيمِ، غَافِرِ الذَّنْبِ وَقَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ ذِي الطَّوْلِ لَا إِلَهَ إِلَّا هُوَ إِلَيْهِ الْمَصِيرُ،''',
        "targetTaps": 1,
    },
    {
        "title": "",
        "description": '''
بسْمِ اللهِ بابُنا، تَبارَكَ حيطانُنا، يس سَقفُنا، كهيعص كِفايَتُنا، حم عسق حِمايَتُنا،         ''',
        "targetTaps": 1,
    },
    {
        "title": "3 مرات",
        "description": '''
فَسَيَكْفِيكَهُمُ اللَّهُ وَهُوَ السَّمِيعُ الْعَلِيمُ
         ''',
        "targetTaps": 3,
    },
    {
        "title": "",
        "description": '''
سِتْرُ العَرشِ مَسْبُولٌ عَلَيْنا،يا حفيظ احفظنا  وَبِحَوْلِ اللهِ لا يُقْدَرُ عَلَيْنا، وَاللَّهُ مِنْ وَرَائِهِمْ مُحِيطٌ، بَلْ هُوَ قُرْآَنٌ مَجِيدٌ، فِي لَوْحٍ مَحْفُوظٍ، 
        ''',
        "targetTaps": 1,
    },
    {
        "title": "3 مرات",
        "description": '''
فَاللَّهُ خَيْرٌ حَافِظاً وَهُوَ أَرْحَمُ الرَّاحِمِينَ 
         ''',
        "targetTaps": 3,
    },
  {
    "title": "3 مرات",
    "description": '''
 إِنَّ وَلِيِّيَ اللَّهُ الَّذِي نَزَّلَ الْكِتَابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ         ''',
    "targetTaps": 3,
  },
  {
    "title": "3 مرات",
    "description": '''
 حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ         ''',
    "targetTaps": 3,
  },
  {
    "title": "3 مرات",
    "description": '''
 بِسْمِ اللهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ في الأرْضِ وَلاَ في السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ        ''',
    "targetTaps": 3,
  },
  {
    "title": "3 مرات",
    "description": '''
  أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ        ''',
    "targetTaps": 3,
  },
  {
    "title": "3 مرات",
    "description": '''
  ولاَ حَوْلَ وَلاَ قُوَّةَ إلّا بِاللهِ العَلِيِّ العَظِيم         ''',
    "targetTaps": 3,
  },
  {
    "title": "",
    "description": '''
وَصَلَّى اللَّهُ على سَيِّدِنَا مُحَمَّدٍ وَعلى آلِهِ وَصَحْبِهِ وَسَلَّم.
        ''',
    "targetTaps": 1,
  },
];
