const List<Map<String, dynamic>> dailywerds = [
{
"title": "7 مرات",
"description": '''
{ وَرَدَّ اَ۬للَّهُ اُ۬لذِينَ كَفَرُواْ بِغَيْظِهِمْ لَمْ يَنَالُواْ خَيْراٗۖ وَكَفَى اَ۬للَّهُ اُ۬لْمُؤْمِنِينَ اَ۬لْقِتَالَۖ وَكَانَ اَ۬للَّهُ قَوِيّاً عَزِيزاٗۖ }.
'''
,"targetTaps" : 7 ,
},
  {
    "title" : "7 مرات",
    "description":'''
    { كُلَّمَا أَوْقَدُواْ نَاراٗ لِّلْحَرْبِ أَطْفَأَهَا اَ۬للَّهُۖ وَيَسْعَوْنَ فِے اِ۬لْأَرْضِ فَسَاداٗۖ وَاللَّهُ لَا يُحِبُّ اُ۬لْمُفْسِدِينَۖ }
    ''',
    "targetTaps": 7
  },
  {
    "title" : "7 مرات",
    "description":'''
{ فَسَيَكْفِيكَهُمُ اُ۬للَّهُۖ وَهْوَ اَ۬لسَّمِيعُ اُ۬لْعَلِيمُۖ }    ''',
    "targetTaps": 7
  },
  {
    "title" : "7 مرات",
    "description":'''
{ وَعَنَتِ اِ۬لْوُجُوهُ لِلْحَيِّ اِ۬لْقَيُّومِۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْماٗۖ }     ''',
    "targetTaps": 7
  },
  {
    "title" : "7 مرات",
    "description":'''
{ فَقُطِعَ دَابِرُ اُ۬لْقَوْمِ اِ۬لذِينَ ظَلَمُواْۖ وَالْحَمْدُ لِلهِ رَبِّ اِ۬لْعَٰلَمِينَۖ }     ''',
    "targetTaps": 7
  },
  {
    "title" : "7 مرات",
    "description":'''
{ وَإِذَا قَرَأْتَ اَ۬لْقُرْءَانَ جَعَلْنَا بَيْنَكَ وَبَيْنَ اَ۬لذِينَ لَا يُؤْمِنُونَ بِالْأٓخِرَةِ حِجَاباٗ مَّسْتُوراٗۖ }      ''',
    "targetTaps": 7
  },
  {
    "title" : "7 مرات",
    "description":'''
    { وَجَعَلْنَا مِنۢ بَيْنِ أَيْدِيهِمْ سُدّاٗ وَمِنْ خَلْفِهِمْ سُدّاٗ فَأَغْشَيْنَٰهُمْ فَهُمْ لَا يُبْصِرُونَۖ } 
      ''',
    "targetTaps": 7
  },
  {
    "title" : "7 مرات",
    "description":'''
    { وَحِيلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُونَ} 
      ''',
    "targetTaps": 7
  },
  {
    "title" : "11 مرة",
    "description":'''
    { وَقَدِمْنَا إِلَىٰ مَا عَمِلُواْ مِنْ عَمَلٖ فَجَعَلْنَٰهُ هَبَآءٗ مَّنثُوراًۖ }
      ''',
    "targetTaps": 11
  },
  {
    "title" : " مرة",
    "description":'''
    ۞اَ۬للَّهُ نُورُ اُ۬لسَّمَٰوَٰتِ وَالْأَرْضِۖ مَثَلُ نُورِهِۦ كَمِشْكَوٰةٖ فِيهَا مِصْبَاحٌۖ اِ۬لْمِصْبَاحُ فِے زُجَاجَةٍۖ اِ۬لزُّجَاجَةُ كَأَنَّهَا كَوْكَبٞ دُرِّيّٞ يُوقَدُ مِن شَجَرَةٖ مُّبَٰرَكَةٖ زَيْتُونَةٖ لَّا شَرْقِيَّةٖ وَلَا غَرْبِيَّةٖ يَكَادُ زَيْتُهَا يُضِےٓءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٞۖ نُّورٌ عَلَيٰ نُورٖۖ يَهْدِے اِ۬للَّهُ لِنُورِهِۦ مَنْ يَّشَآءُۖ وَيَضْرِبُ اُ۬للَّهُ اُ۬لْأَمْثَٰلَ لِلنَّاسِۖ وَاللَّهُ بِكُلِّ شَےْءٍ عَلِيمٞۖ (35)
      ''',
    "targetTaps": 1
  }
];