const List<Map<String, dynamic>> experiences = [

  {
    "title": "3 مرات",
    "description": '''
 بِسْمِ اللهِ الَّذِي لا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ في الأرْضِ وَلاَ في السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ        ''',
    "targetTaps": 3,
  },
  {
    "title": "7 مرات",
    "description": "حسبيَ اللهُ لا إله إلا هُو، عليهِ توكَّلتُ، وهوَ ربُّ العرشِ العظيمِ."
    ,"targetTaps" : 7 ,
  },
  {
    "title": "7 مرات",
    "description": "اللهُ اللهُ ربِّي، لا أُشرِكُ به شيئًا"
    ,"targetTaps" : 7 ,
  },
  {
    "title": "7 مرات",
    "description": "۞وَعَنَتِ اِ۬لْوُجُوهُ لِلْحَيِّ اِ۬لْقَيُّومِۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْماٗۖ"
    ,"targetTaps" : 7 ,
  },
  {
    "title": "3 مرات",
    "description": " رضيتُ باللهِ ربًّا وبالإسلامِ دينًا وبمحمدٍ صلى الله عليه وسلم نبيًّا و رسولًاََ"
    ,"targetTaps" : 3 ,
  },
  {
    "title": "3 مرات",
    "description": "يا حيُّ يا قيُّومُ برحمتِكَ أستغيثُ أصلِحْ لي شأني كُلَّهُ ولا تَكِلني إلى نفسي طرفةَ عين."
    ,"targetTaps" : 3 ,
  },
  {
    "title": "4 مرات",
    "description": '''
    اللَّهُمَّ إِنِّي أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلَائِكَتَكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ.
    '''
    ,"targetTaps" : 4 ,
  },

  {
    "title": "مرة",
    "description": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَأَنَّ عِيسَى عَبْدُ اللهِ وَرَسُولُهُ، وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ.َ"
    ,"targetTaps" : 1 ,
  },

  {
    "title": "مرة",
    "description": '''
    إِنَّ رَبِّيَ اللهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ
مَا شَاءَ اللهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ
أَشْهَدُ أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنَّ اللهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا أَعُوذُ بِاللهِ الَّذِي يُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الْأَرْضِ إِلَّا بِإِذْنِهِ مِنْ شَرِّ كُلِّ دَابَّةٍ رَبِّي آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ.
    '''
    ,"targetTaps" : 1 ,
  },
  {
    "title": "3 مرات",
    "description": "أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنَ الشَّيْطَانِ الرَّجِيمِ."
    ,"targetTaps" : 3 ,
  },
  {
    "title": "مرة",
    "description": '''
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم

هُوَ اَ۬للَّهُ اُ۬لذِے لَا إِلَٰهَ إِلَّا هُوَ عَٰلِمُ اُ۬لْغَيْبِ وَالشَّهَٰدَةِۖ هُوَ اَ۬لرَّحْمَٰنُ اُ۬لرَّحِيمُۖ (22) هُوَ اَ۬للَّهُ اُ۬لذِے لَا إِلَٰهَ إِلَّا هُوَ اَ۬لْمَلِكُ اُ۬لْقُدُّوسُ اُ۬لسَّلَٰمُ اُ۬لْمُؤْمِنُ اُ۬لْمُهَيْمِنُ اُ۬لْعَزِيزُ اُ۬لْجَبَّارُ اُ۬لْمُتَكَبِّرُۖ سُبْحَٰنَ اَ۬للَّهِ عَمَّا يُشْرِكُونَۖ (23) هُوَ اَ۬للَّهُ اُ۬لْخَٰلِقُ اُ۬لْبَارِۓُ اُ۬لْمُصَوِّرُۖ لَهُ اُ۬لْأَسْمَآءُ اُ۬لْحُسْنَيٰۖ يُسَبِّحُ لَهُۥ مَا فِے اِ۬لسَّمَٰوَٰتِ وَالْأَرْضِۖ وَهْوَ اَ۬لْعَزِيزُ اُ۬لْحَكِيمُۖ (24)    '''
    ,"targetTaps" : 1 ,
  },
  {
    "title": "3 مرات",
    "description": " أعوذ بكلمات الله التّامّة من كل شيطان وهامّة ومن كل عين لامّة. "
    ,"targetTaps" : 3 ,
  },
  {
    "title": "3 مرات",
    "description": "وقُل رب أعوذُ بِكَ منْ همزاتِ الشياطين وأعوذُ بِكَ رب أن يحضرون."
    ,"targetTaps" : 3 ,
  },
{
"title": "3 مرات",
"description": """أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ، مِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَٰنُ.
"""
,"targetTaps" : 3 ,
},
  {
    "title": "3 مرات",
    "description": """
    اَللَّهُمَّ ذَا السُّلْطَانِ الْعَظِيمِ، وَالْمَنِّ الْقَدِيمِ، ذَا الرَّحْمَةِ الْكَرِيمِ، وَلِيَّ الْكَلِمَاتِ التَّامَّاتِ، وَالدَّعَوَاتِ الْمُسْتَجَابَاتِ، عَافِنِي، مِنْ أَنْفُسِ الْجِنِّ، وَأَعْيُنِ الْإِنْسِ.
"""
    ,"targetTaps" : 3 ,
  },
  {
    "title": "3 مرات",
    "description": "بسم الله ما شاء الله، ﻻ يسوق الخير إﻻ الله بسم الله ما شاء الله، ﻻ يصرف السوء إﻻ الله بسم الله ما شاء الله، ما كان من نعمة فمن الله بسم الله ما شاء الله، ﻻ حول وﻻ قوة إﻻ بالله"
    ,"targetTaps" : 3 ,
  },
  {
    "title": "مرة",
    "description": '''
    اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اَللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اَللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي.
    '''
    ,"targetTaps" : 1 ,
  },
  {
    "title": "3 مرات",
    "description": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ."
    ,"targetTaps" : 3 ,
  },
  {
    "title": "3 مرات",
    "description": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ."
    ,"targetTaps" : 3 ,
  },
  {
    "title": "مرة",
    "description": "✴  اللهمَّ فاطِرَ السَّمواتِ والأرضِ عالمَ الغيبِ والشهادةِ ربَّ كُلّ شيءٍ ومليكهُ، أشهدُ أن لا إلهَ إلا أنتَ، أعوذُ بكَ مِن شرِّ نفسي وشر الشيطانِ وشِركِهِ."
    ,"targetTaps" : 1 ,
  },
  {
    "title": "مرة",
    "description": "✴  لا إلٰه إلا اللّٰهُ وحدهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحمدُ وهو على كل شيء قدير ."
    ,"targetTaps" : 1 ,
  },
  {
    "title": "مرة",
    "description": "الْحَمْدُ لِلَّهِ رَبِّي لَا أُشْرِكُ بِهِ شَيْئًا وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ."
    ,"targetTaps" : 1 ,
  },
  {
    "title": "مرة",
    "description": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ."
    ,"targetTaps" : 1 ,
  },
  {
    "title": "مرة",
    "description": "اللهمَّ أنتَ ربي لا إلهَ إلا أنتَ خلَقتني وأنا عبدُكَ (المرأة تقول: وأنا أمتُك) وأنا على عهدِكَ ووعدِكَ ما استطعتُ، أعوذُ بكَ من شرِّ ما صنعتُ، أبوءُ لكَ بِنِعمَتِكَ عليَّ، وأبوءُ بذنبي فاغفرْ لي فإنَّهُ لا يَغفرُ الذنوبَ إلا أنتَ"
    ,"targetTaps" : 1 ,
  },
  {
    "title": "مرة",
    "description": """
    بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم    
    ءَامَنَ الرَّسُولُ بِمَا أُنزِلَ إلَيْهِ مِن رَبِّهِ وَالمُؤْمِنُونَ كُلٌّ ءَامَنَ بِاللهِ وَمَلائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِن رُسِلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ المَصِيرُ ، لاَ يُكَلِّفُ اللَّهُ نَفْساً إلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلانَا فَانصُرْنا عَلَى القَوْمِ الكَافِرِين
        """
    ,"targetTaps" : 1 ,
  },

  {
    "title": "3 مرات",
    "description": """
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم

 قُلْ هُوَ اَ۬للَّهُ أَحَدٌۖ (1) اِ۬للَّهُ اُ۬لصَّمَدُۖ (2) لَمْ يَلِدْ وَلَمْ يُولَدْۖ (3) وَلَمْ يَكُن لَّهُۥ كُفُؤاً أَحَدُۢۖ (4)"""
    ,"targetTaps" : 3 ,
  },

  {
    "title": "3 مرات",
    "description": """
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم

 قُلْ أَعُوذُ بِرَبِّ اِ۬لْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ اِ۬لنَّفَّٰثَٰتِ فِے اِ۬لْعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَۖ (5)"""
    ,"targetTaps" : 3 ,
  },


  {
    "title": "3 مرات",
    "description": """
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم

 قُلْ أَعُوذُ بِرَبِّ اِ۬لنَّاسِ (1) مَلِكِ اِ۬لنَّاسِ (2) إِلَٰهِ اِ۬لنَّاسِ (3) مِن شَرِّ اِ۬لْوَسْوَاسِ اِ۬لْخَنَّاسِ (4) اِ۬لذِے يُوَسْوِسُ فِے صُدُورِ اِ۬لنَّاسِ (5) مِنَ اَ۬لْجِنَّةِ وَالنَّاسِۖ (6)"""
    ,"targetTaps" : 3 ,
  },















];
